# 定义的表格位置
custom_positions = {
    "13周": {
        "周一": {"第3-4节": ["C24", "D24"]},
        "周二": {"第1-2节": ["C25", "D25"]},
        "周三": {"第3-4节": ["C26", "D26"]},
        "周四": {"第1-2节": ["C27", "D27"]},
        "周五": {"第1-2节": ["C28", "D28"]}
    },
    "14周": {
        "周一": {"第3-4节": ["C35", "D35"]},
        "周二": {"第7-8节": ["C36", "D36"]},
        "周三": {"第3-4节": ["C37", "D37"]},
        "周四": {
            "第1-2节": ["C38", "D38"],
            "第3-4节": ["C39", "D39"]
        },
        "周五": {"第1-2节": ["C40", "D40"]}
        },
    "15周": {
        "周一": {"第3-4节": ["C47", "D47"]},
        "周二": {"第7-8节": ["C48", "D48"]},
        "周三": {"第3-4节": ["C49", "D49"]},
        "周四": {
            "第1-2节": ["C50", "D50"],
            "第3-4节": ["C51", "D51"]
        },
        "周五": {"第1-2节": ["C52", "D52"]}
        },
    "16周": {
        "周一": {"第3-4节": ["C59", "D59"]},
        "周二": {"第7-8节": ["C60", "D60"]},
        "周三": {"第3-4节": ["C61", "D61"]},
        "周四": {
            "第1-2节": ["C62", "D62"],
            "第3-4节": ["C63", "D63"]
        },
        "周五": {"第1-2节": ["C64", "D64"]}
        },
    "17周": {
        "周一": {"第1-2节": ["C68", "D68"]},
        "周二": {"第3-4节": ["C69", "D69"]},
        "周三": {"第5-6节": ["C70", "D70"]},
        "周四": {"第3-4节": ["C71", "D71"]},
        "周五": {"第3-4节": ["C72", "D72"]}
        }
}


# 定义所有周次和时间段
week13 = {
        "周一": ["第3-4节"],
        "周二": ["第1-2节"],
        "周三": ["第3-4节"],
        "周四": ["第1-2节"],
        "周五": ["第1-2节"]
    }
week14 = {
        "周一": ["第3-4节"],
        "周二": ["第7-8节"],
        "周三": ["第3-4节"],
        "周四": {"第1-2节", "第3-4节"},
        "周五": ["第1-2节"]
    }
week15 = {
        "周一": ["第3-4节"],
        "周二": ["第7-8节"],
        "周三": ["第3-4节"],
        "周四": {"第1-2节", "第3-4节"},
        "周五": ["第1-2节"]
    }
week16 = {
        "周一": ["第3-4节"],
        "周二": ["第7-8节"],
        "周三": ["第3-4节"],
        "周四": {"第1-2节", "第3-4节"},
        "周五": ["第1-2节"]
    }
week17 = {
        "周一": ["第1-2节"],
        "周二": ["第3-4节"],
        "周三": ["第5-6节"],
        "周四": ["第3-4节"],
        "周五": ["第3-4节"]
    }

def choiceWeek(week):
    if week == '13周':
        return week13
    elif week == '14周':
        return week14
    elif week == '15周':
        return week15
    elif week == '16周':
        return week16
    elif week == '17周':
        return week17
    else:
        return
